Tutorials/2D/interQHDFoam/mixingChannel/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

phases (l g);

nul  nul  [0 2 -1 0 0]            1e-05;
rhol rhol [1 -3 0 0 0]            1;
nug  nug  [0 2 -1 0 0]            1e-05;
rhog rhog [1 -3 0 0 0]            0.001;
taul      [0 0 1 0 0 ]            0.2500e-3; //liquid
taug      [0 0 1 0 0 ]            0.5000e-3; //air
sigma     [1 0 -2 0 0]            0.0;

QGD
{
    implicitDiffusion true;
    QGDCoeffs twoPhaseConstTau;
    
    twoPhaseConstTauDict
    {
    }
}
